loligo/lps/boards.txt
##############################################################

lpsv11_16.name=LPS v1.1 5V/16MHz
lpsv11_16.upload.protocol=arduino
lpsv11_16.upload.maximum_size=30720
lpsv11_16.upload.speed=57600
lpsv11_16.upload.disable_flushing=true
lpsv11_16.bootloader.low_fuses=0xff
lpsv11_16.bootloader.high_fuses=0xDE
lpsv11_16.bootloader.extended_fuses=0x05
lpsv11_16.bootloader.path=optiboot
lpsv11_16.bootloader.file=optiboot-lpsv11_16.hex
lpsv11_16.bootloader.unlock_bits=0x3F
lpsv11_16.bootloader.lock_bits=0x2F
lpsv11_16.build.mcu=atmega328p
lpsv11_16.build.f_cpu=16000000L
lpsv11_16.build.core=arduino
lpsv11_16.build.variant=eightanaloginputs

##############################################################

lpsv11_20.name=LPS v1.1 5V/20MHz
lpsv11_20.upload.protocol=arduino
lpsv11_20.upload.maximum_size=30720
lpsv11_20.upload.speed=57600
lpsv11_20.upload.disable_flushing=true
lpsv11_20.bootloader.low_fuses=0xff
lpsv11_20.bootloader.high_fuses=0xDE
lpsv11_20.bootloader.extended_fuses=0x05
lpsv11_20.bootloader.path=optiboot
lpsv11_20.bootloader.file=optiboot-lpsv11_20.hex
lpsv11_20.bootloader.unlock_bits=0x3F
lpsv11_20.bootloader.lock_bits=0x2F
lpsv11_20.build.mcu=atmega328p
lpsv11_20.build.f_cpu=16000000L
lpsv11_20.build.core=arduino
lpsv11_20.build.variant=eightanaloginputs

##############################################################

lpsv12_16.name=LPS v1.2 5V/16MHz
lpsv12_16.upload.protocol=arduino
lpsv12_16.upload.maximum_size=30720
lpsv12_16.upload.speed=57600
lpsv12_16.upload.disable_flushing=true
lpsv12_16.bootloader.low_fuses=0xff
lpsv12_16.bootloader.high_fuses=0xDE
lpsv12_16.bootloader.extended_fuses=0x05
lpsv12_16.bootloader.path=optiboot
lpsv12_16.bootloader.file=optiboot-lpsv11_16.hex
lpsv12_16.bootloader.unlock_bits=0x3F
lpsv12_16.bootloader.lock_bits=0x2F
lpsv12_16.build.mcu=atmega328p
lpsv12_16.build.f_cpu=16000000L
lpsv12_16.build.core=arduino
lpsv12_16.build.variant=eightanaloginputs

##############################################################

lpsminiv10_8.name=LPSmini v1.0 3.3V/8MHz
lpsminiv10_8.upload.protocol=arduino
lpsminiv10_8.upload.maximum_size=30720
lpsminiv10_8.upload.speed=57600
lpsminiv10_8.upload.disable_flushing=true
lpsminiv10_8.bootloader.low_fuses=0xff
lpsminiv10_8.bootloader.high_fuses=0xde
lpsminiv10_8.bootloader.extended_fuses=0x05
lpsminiv10_8.bootloader.path=optiboot
lpsminiv10_8.bootloader.file=optiboot-lpsminiv10_8.hex
lpsminiv10_8.bootloader.unlock_bits=0x3F
lpsminiv10_8.bootloader.lock_bits=0x2F
lpsminiv10_8.build.mcu=atmega328p
lpsminiv10_8.build.f_cpu=8000000L
lpsminiv10_8.build.core=arduino
lpsminiv10_8.build.variant=eightanaloginputs

##############################################################

lpsminiv10_12.name=LPSmini v1.0 3.3V/12MHz
lpsminiv10_12.upload.protocol=arduino
lpsminiv10_12.upload.maximum_size=30720
lpsminiv10_12.upload.speed=57600
lpsminiv10_12.upload.disable_flushing=true
lpsminiv10_12.bootloader.low_fuses=0xff
lpsminiv10_12.bootloader.high_fuses=0xde
lpsminiv10_12.bootloader.extended_fuses=0x05
lpsminiv10_12.bootloader.path=optiboot
lpsminiv10_12.bootloader.file=optiboot-lpsminiv10_12.hex
lpsminiv10_12.bootloader.unlock_bits=0x3F
lpsminiv10_12.bootloader.lock_bits=0x2F
lpsminiv10_12.build.mcu=atmega328p
lpsminiv10_12.build.f_cpu=12000000L
lpsminiv10_12.build.core=arduino
lpsminiv10_12.build.variant=eightanaloginputs

##############################################################

lpsminiv11_12.name=LPSmini v1.1 3.3V/12MHz
lpsminiv11_12.upload.protocol=arduino
lpsminiv11_12.upload.maximum_size=30720
lpsminiv11_12.upload.speed=57600
lpsminiv11_12.upload.disable_flushing=true
lpsminiv11_12.bootloader.low_fuses=0xff
lpsminiv11_12.bootloader.high_fuses=0xde
lpsminiv11_12.bootloader.extended_fuses=0x05
lpsminiv11_12.bootloader.path=optiboot
lpsminiv11_12.bootloader.file=optiboot-lpsminiv10_12.hex
lpsminiv11_12.bootloader.unlock_bits=0x3F
lpsminiv11_12.bootloader.lock_bits=0x2F
lpsminiv11_12.build.mcu=atmega328p
lpsminiv11_12.build.f_cpu=12000000L
lpsminiv11_12.build.core=arduino
lpsminiv11_12.build.variant=eightanaloginputs

